run/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   uniform (0 0 0);

boundaryField
{
    ox
    {
        type            fixedValue;
        value           uniform (4 0 0);
    }
    FuelF
{
    type                fixedNormalInletOutletVelocity;
    fixTangentialInflow false;

    normalVelocity
    {
        type            uniformFixedValue;
        uniformValue    constant (29 0 0);
    }

    value               uniform (0 0 0);
}
    FuelH
{
    type                fixedNormalInletOutletVelocity;
    fixTangentialInflow false;

    normalVelocity
    {
        type            uniformFixedValue;
        uniformValue    constant (29 0 0);
    }

    value               uniform (0 0 0);
}
    Outlet
    {
        type            inletOutlet;
        inletValue          uniform (0 0 0);
        value           uniform (0 0 0);

    }
    Wedge1
    {
        type            symmetry;
    }
    Wedge2
    {
        type            symmetry;
    }
    Walls
    {
        type            noSlip;
    }
}


// ************************************************************************* //
